### سياسة الخصوصية

تنطبق سياسة الخصوصية هذه على تطبيق Swat Gym (يُشار إليه فيما يلي بـ "التطبيق") للأجهزة المحمولة، والذي تم إنشاؤه بواسطة محمود (يُشار إليه فيما يلي بـ "مزود الخدمة") كخدمة مجانية. هذه الخدمة مخصصة للاستخدام "كما هي".

#### جمع المعلومات واستخدامها

يقوم التطبيق بجمع معلومات عند تنزيلك له واستخدامك إياه. قد تشمل هذه المعلومات ما يلي:
- عنوان بروتوكول الإنترنت لجهازك (مثل عنوان IP)
- الصفحات في التطبيق التي تزورها، وتاريخ ووقت الزيارة، والوقت المقضي في تلك الصفحات
- الوقت المقضي في التطبيق
- نظام التشغيل المستخدم على جهازك المحمول

لا يقوم التطبيق بجمع معلومات دقيقة عن موقع جهازك المحمول.

قد يستخدم مزود الخدمة المعلومات التي قدمتها للتواصل معك من وقت لآخر لتقديم معلومات هامة، وإشعارات مطلوبة، وعروض ترويجية تسويقية.

للحصول على تجربة أفضل أثناء استخدام التطبيق، قد يطلب منك مزود الخدمة تقديم بعض المعلومات الشخصية القابلة للتعريف. سيتم الاحتفاظ بالمعلومات التي يطلبها مزود الخدمة لديهم واستخدامها كما هو موصوف في سياسة الخصوصية هذه.

#### الوصول من قبل أطراف ثالثة

يتم نقل البيانات المجمعة والمجهولة الهوية فقط بشكل دوري إلى خدمات خارجية لمساعدة مزود الخدمة في تحسين التطبيق وخدمتهم. قد يشارك مزود الخدمة معلوماتك مع أطراف ثالثة بالطرق الموصوفة في بيان الخصوصية هذا.

يرجى ملاحظة أن التطبيق يستخدم خدمات أطراف ثالثة لها سياسة خصوصية خاصة بها بشأن التعامل مع البيانات. فيما يلي روابط سياسات الخصوصية لمزودي الخدمات الخارجيين المستخدمين في التطبيق:
- خدمات Google Play

قد يفصح مزود الخدمة عن المعلومات المقدمة من المستخدم والمعلومات المجمعة تلقائيًا:
- عندما يقتضي القانون ذلك، مثل الامتثال لأمر استدعاء أو إجراء قانوني مشابه
- عندما يعتقدون بحسن نية أن الإفصاح ضروري لحماية حقوقهم، أو حماية سلامتك أو سلامة الآخرين، أو التحقيق في الاحتيال، أو الرد على طلب حكومي
- مع مزودي الخدمات الموثوقين الذين يعملون نيابة عنهم، ولا يملكون استخدامًا مستقلًا للمعلومات التي نفصحها لهم، وقد وافقوا على الالتزام بالقواعد المنصوص عليها في بيان الخصوصية هذا

#### حقوق الانسحاب (Opt-Out)

يمكنك إيقاف جميع عمليات جمع المعلومات بواسطة التطبيق بسهولة عن طريق إزالة تثبيته. يمكنك استخدام عمليات الإزالة القياسية المتاحة كجزء من جهازك المحمول أو عبر سوق التطبيقات المحمولة أو الشبكة.

#### سياسة الاحتفاظ بالبيانات

سيحتفظ مزود الخدمة ببيانات المستخدم المقدمة طالما كنت تستخدم التطبيق ولفترة معقولة بعد ذلك. إذا كنت ترغب في حذفهم لبيانات المستخدم المقدمة التي قدمتها عبر التطبيق، يرجى الاتصال بهم على mido10sb@gmail.com وسيردون في وقت معقول.

#### الأطفال

لا يستخدم مزود الخدمة التطبيق لجمع بيانات من الأطفال دون سن 13 عامًا أو التسويق لهم عن علم.

لا يوجه التطبيق إلى أي شخص دون سن 13 عامًا. لا يجمع مزود الخدمة عن علم معلومات شخصية قابلة للتعريف من الأطفال دون سن 13 عامًا. في حال اكتشف مزود الخدمة أن طفلًا دون سن 13 عامًا قد قدم معلومات شخصية، سيقوم مزود الخدمة بحذفها فورًا من خوادمهم. إذا كنت ولي أمر أو وصيًا وكنت على علم بأن طفلك قد قدم لنا معلومات شخصية، يرجى الاتصال بمزود الخدمة (mido10sb@gmail.com) حتى يتمكنوا من اتخاذ الإجراءات اللازمة.

#### الأمان

يهتم مزود الخدمة بحماية سرية معلوماتك. يوفر مزود الخدمة ضمانات فيزيائية وإلكترونية وإجرائية لحماية المعلومات التي يعالجها ويحتفظ بها.

#### التغييرات

قد يتم تحديث سياسة الخصوصية هذه من وقت لآخر لأي سبب. سيقوم مزود الخدمة بإخطارك بأي تغييرات في سياسة الخصوصية عن طريق تحديث هذه الصفحة بسياسة الخصوصية الجديدة. يُنصح بمراجعة سياسة الخصوصية هذه بانتظام لأي تغييرات، حيث يُعتبر الاستخدام المستمر موافقة على جميع التغييرات.

تسري سياسة الخصوصية هذه اعتبارًا من 2025-12-23

#### موافقتك

باستخدام التطبيق، فإنك توافق على معالجة معلوماتك كما هو منصوص عليه في سياسة الخصوصية هذه الآن وكما نعدلها نحن.

#### اتصل بنا

إذا كان لديك أي أسئلة بشأن الخصوصية أثناء استخدام التطبيق، أو أسئلة حول الممارسات، يرجى الاتصال بمزود الخدمة عبر البريد الإلكتروني على mido10sb@gmail.com.
